{"data":{"wordpressPost":{"id":"aa7ba666-e001-58ea-9471-303a1aa33dcd","title":"How To Be More Than A Stereotype","slug":"stereotype","content":"<p>When I was 11 years old I saw a news story about a controversy generated by the new talking Barbie doll. The uproar was caused by one of Barbie&#8217;s lines: &#8220;<a href=\"https://www.youtube.com/watch?v=NO0cvqT1tAE\" target=\"new\">Math class is tough</a>.&#8221;</p>\n<p>Frankly, I was too young at the time to really know what to think of it. I was painfully aware of racism and homophobia, but didn&#8217;t know what I was supposed to do when I witnessed it. Controversy around my own gender was even more confusing.</p>\n<p>Was math class hard? Well&#8230; no, actually. It wasn&#8217;t hard. Was I expected to think it was? Maybe it was weird that I didn&#8217;t think math was hard. Was I weird?</p>\n<p>Fast forward to my teenage years, and despite the fact that earth science and physics were among my favorite courses in high school (I also did well in maths and the other sciences), at no point did it occur to me to pursue them in college and work. I showed aptitude for writing, so when my AP English teacher asked what I might pursue in the future, journalism was my best guess.</p>\n<p>Why not a STEM career? I guess I just didn&#8217;t see myself as a lab coat kind of person&#8230;</p>\n<h3>Sterotype Threat</h3>\n<p>I don&#8217;t want to spend all my time focusing on what&#8217;s wrong with the messages people are receiving about their gender, race, socioeconomic status, or other belittled demographic group. But in order to get to the fun part &#8211; counteracting those messages &#8211; a brief description is definitely necessary.</p>\n<blockquote><p>&#8220;Stereotype threat refers to being at risk of confirming, as self-characteristic, a negative stereotype about one&#8217;s group. </p>\n<p>This term was first used by Steele and Aronson who showed in several experiments that Black college freshmen and sophomores performed more poorly on standardized tests than White students when their race was emphasized. </p>\n<p><em>When race was not emphasized, however, Black students performed better and equivalently with White students</em>.&#8221; </p>\n<p>&#8211; From <a href=\"http://www.reducingstereotypethreat.org/definition.html\" target=\"new\">ReducingStereotypeThreat.org</a>, emphasis mine.</p></blockquote>\n<h2>Reflecting a More Complex Reality</h2>\n<p>I had a really great job a while back where I was introduced to the idea of a diversity board. Apparently, someone had found that being exposed to positive images of minorities led to a decrease in racist thinking, and in the spirit of awesomeness, we were to create a display of people we admired from a variety of races.</p>\n<p>Today, a Google search for &#8220;diversity board&#8221; only brings up bulletin board ideas for gradeschool, and no potential ideas for implementation in more grown-up settings. It has been shown, though, that reading about or taking tests in the same room as positive role models has been shown to reduce the negative impacts of stereotype threat, so the diversity board idea certainly has some science to back it up, if indirectly.</p>\n<p>Not only are positive role models helpful, so is taking the time to reflect on the reality that people are much more complex and, frankly, more interesting than these negative stereotypes would lead you to believe. There are other strategies as well, including the following suggestions I found on<a href=\"http://www.reducingstereotypethreat.org/reduce.html\" target=\"new\">ReducingStereotypeThreat.org</a>:<br />\n&nbsp;<br />\nEmphasizing one&#8217;s</p>\n<ul>\n<li>valued, unique and idiosyncratic characteristics</li>\n<li>membership in groups that do well</li>\n<li>self-worth</li>\n<li>values</li>\n</ul>\n<p>&nbsp;<br />\nHaving</p>\n<ul>\n<li>a complex self-concept</li>\n<li>role models</li>\n</ul>\n<p>&nbsp;<br />\nRemembering</p>\n<ul>\n<li>the topic is difficult, <em>and</em> you are capable of working through it</li>\n</ul>\n<p>&nbsp;</p>\n<h3>Get Specific</h3>\n<p>The folks in the studies were given a variety of prompts to combat stereotype threat, from contextual clues to essay assignments. To see the benefits of these techinques, take some time to consider them for yourself. For example:</p>\n<p><strong>Thinking of oneself in terms of one&#8217;s values reduces stereotype threat</strong><br />\nI feel strongly about social and environmental issues. I value ongoing personal and intellectual growth. It is important to me to experience cultures different than my own so that I have a more nuanced understanding of what constitutes &#8220;reality.&#8221;</p>\n<p><strong>Emphasizing membership in groups that have positive or no stereotypes regarding the subject matter helps reduce stereotype threat</strong><br />\nI have a college degree. I tested into the gifted program in grade school.</p>\n<p><strong>Highlighting unique and valued characteristics reduces stereotype threat</strong><br />\nI have been vegetarian since 2001. I traveled to 13 countries on 4 continents in 2013 and have been to 17 foreign countries total. I am 6 inches taller than my fraternal twin sister. I have better than average skill at writing, photography, and drawing, and can succeed at any related project given to me. I have held leadership roles at six different companies. I have lived in seven different states. My attention to detail has won me an award and saved a past employer tens of thousands of dollars.</p>\n<p>What do <em>you</em> value? What makes you unique?</p>\n<p>(For a thoughtful piece on growth and deepening understanding, see Kelly Yamamoto&#8217;s <a href=\"http://minedamnesia.github.io/blog-posts/week6_cultural.html\" target=\"new\">Stereotype Threat</a>.)</p>\n<h2>Bonus: Creating An Inclusive Environment</h2>\n<p>Not being drawn into a negative stereotype is a fantastic goal, but an even more noble one is to help prevent others from experiencing steroetype threat as well. The question of how to address stereotype threat in school or in the workplace is a tricky one, though.</p>\n<p>It is certainly possible to notice that a partner on a group project is having trouble, but how do you know if it&#8217;s stereotype threat? If your partner seems anxious, a gentle reminder that it is a difficult subject for <em>everyone</em> and you have confidence in their ability to work through it, could be helpful whether or not stereotype threat is involved. Explaining how stereotype threat works has been shown to help reduce it, as well.</p>\n<h3>Stopping Stereotyping Behavior</h3>\n<p>The more potentially difficult situation is witnessing stereotyping behavior in others.</p>\n<p>Is it appropriate to call people out, and how do you do it? Student/teacher or employer/employee relationships are especially tricky, as you don&#8217;t want to offend someone who has direct influence on your future success.</p>\n<p>It might seem somewhat Machiavellian to have to think this way, but sometimes the wisest course is proactively building relationships and creating some political leverage before you have a problem. If the person with the offending behavior likes and trusts you, it is much easier to take a constructive approach that won&#8217;t put them on the defensive &#8211; you&#8217;ve not going to get anywhere if they get defensive. And you are always better off having people who are willing to back you up in a potentially contentious situation.</p>\n<h4>Publicly:</h4>\n<p>If you have a good relationship and you think the person can handle a public ribbing, you might be able to make a joke of it (&#8220;Sexist Sam is at it again!&#8221;) or simply point out the behavior and leave it at that (I have had success with stating, &#8220;Well that was sexual harassment,&#8221; and turning back to my work &#8211; I received a very sincere apology the next day and had no more problems going forward). This establishes a valuable precedence for immediate negative feedback after offending comments or behaviors, and can help reduce the likelihood of future incidences.</p>\n<h4>Privately:</h4>\n<p>Most people are better off being approached privately, though, to minimize the likelihood of a defensive reaction and maximize the potential that they will learn what appropriate behavior does and does not look like.</p>\n<p>Starting a conversation with, &#8220;I really believe that you didn&#8217;t mean to come off as racist,&#8221; can show that you&#8217;re on their side (and yes, sometimes you should say that even when you don&#8217;t believe it). You can frame the conversation as wanting to help them act in their own best interest: &#8220;Just wanted to let you know that what you said sounded pretty bad,&#8221; <em>for this reason</em>, &#8220;and I want to make sure you don&#8217;t get in trouble with HR&#8221; or &#8220;I think you might have hurt Joe&#8217;s feelings and he really respects you. I&#8217;d hate to see your relationship suffer because of a misunderstanding.&#8221; Subtly reminding people that others are individuals and not simply members of a demographic group can be helpful.</p>\n<p>Giving them the out to say it was more about mis-speaking than belief can go a long way towards bringing attention to what is and isn&#8217;t appropriate, without creating drama. Most people, when given the opportunity to think about it, will admit they don&#8217;t actually believe a stereotype or at the very least don&#8217;t believe it about the specific person they&#8217;ve put down (this is why you say you believe they didn&#8217;t mean it &#8211; they probably didn&#8217;t).</p>\n<h4>When They Really Believe It:</h4>\n<p>Unfortunately, though, some people honestly believe the stereotypes they&#8217;re spreading. If you think that an approach like, &#8220;But you can see that saying that makes Sally uncomfortable and that&#8217;s bad for the team,&#8221; won&#8217;t work, this is where you may need to pull the political leverage you&#8217;ve been building. That person&#8217;s boss might not be able to convince them that women aren&#8217;t bad at math, but a boss can give a direct order not to verbalize that belief.</p>\n<p>You can also speak with the other members of the team and create a plan to consistently speak up against offensive behavior. If enough people in the group won&#8217;t a comment slide, you&#8217;re well on your way towards an inclusive culture. Also, this might be your best option if the offender doesn&#8217;t have a boss.</p>\n<h4>Be Cool</h4>\n<p>Whatever you do, make sure you take that person&#8217;s cultural origin into consideration (as always, being careful not to stereotype!). Many non-American cultures and American sub-cultures place a different kind of emphasis on authority &#8211; perhaps having someone they respect talk to them would be more effective than approaching them yourself. Some cultures have taboos around publicly chastising or giving constructive feedback to people. When in doubt, speak to the person privately.</p>\n<p>In your attempt to create a safe environment for your team, make sure you&#8217;re not making culturally-insensitive mistakes yourself!</p>\n<h3>Help Yourself and Help Others</h3>\n<p>By being aware of the negative effects of stereotype threat on your own performance and self-image, you can take action to minimize or remove the potential harm. Not only will that have positive repurcussions in your own life, but you will become a positive role model that others can look up to, effectively creating exponential impact and making an important step towards reducing the harm created by negative stereotypes.</p>\n<p>We are all complex individuals with important values and the ability to improve through effort. Don&#8217;t be shy in reminding yourself (and others) of that fact!</p>\n","date":"July 13, 2014","categories":[{"name":"culture","slug":"culture"},{"name":"ones and zeros","slug":"ones-and-zeros"}],"tags":null,"author":{"name":"jessica","slug":"jessica"}}},"pageContext":{"id":"aa7ba666-e001-58ea-9471-303a1aa33dcd"}}