{"data":{"wordpressPost":{"id":"5c72fc2c-83cc-51d1-a626-cc21a51e8409","title":"Panel: The Path to CTO","slug":"panel-path-cto","content":"<p>April&#8217;s meetup is up! This one&#8217;s super exciting because it will be a group of high profile tech leaders talking about how they got to where they are. Check out the description below!</p>\n<p><a title=\"Write/Speak/Code NYC meetup\" href=\"https://www.meetup.com/Write-Speak-Code-NYC/events/249062541/\" target=\"_blank\">Sign up here</a></p>\n<hr />\n<p>The Chief Technology Officer helps to craft an entire company&#8217;s technology strategy. She is an expert at balancing competing goals to create the best solutions.</p>\n<p>But how do you level up to this position and what are the challenges you might face on the way, especially in an industry that’s struggling with fair representation?</p>\n<p>In this meetup, we will host a panel of CTOs from companies in New York. They’ll talk about their experiences as women in tech, some challenges and wins, and how you might prepare to take on that role yourself!</p>\n<p>Our panelists:</p>\n<p>Yvette Pasqua, CTO at Meetup<br />\nYvette leads the engineering team with a focus on continuous learning, iterating, and using data to launch software that brings people together around the world to do more of what they love. Her team&#8217;s work enables 35+ million members in over 180 countries to organize and meetup in real life. <a title=\"https://twitter.com/lolarobot\" href=\"https://twitter.com/lolarobot\" target=\"__blank\">https://twitter.com/lolarobot</a></p>\n<p>Mary Ferguson, former VP Engineering at Etsy<br />\nMary is an experienced leader of technical professionals, who has hired, nurtured, and managed multiple cross-functional teams. She has a significant track record of managing both complex projects and technologies. Mary has demonstrated excellence in innovation and in managing operations. She takes a balanced, consultative approach to technology ensuring that her teams can break new ground while remaining closely integrated both with business strategy imperatives as well as technological realities. She was most recently VP, Engineering at Etsy.</p>\n<p>Camille Fournier, Managing Director at Two Sigma, former CTO Rent the &#8211; Runway<br />\nCamille is a Managing Director and Head of Platform Engineering at Two Sigma. She is the former Chief Technology Officer of Rent The Runway and a former Vice President of Technology at Goldman Sachs. <a title=\"https://twitter.com/skamille\" href=\"https://twitter.com/skamille\" target=\"__blank\">https://twitter.com/skamille</a></p>\n<p>Minerva Tantoco, CTO<br />\nMinerva is an inventor, patent-holder, innovator, mom, and former first CTO of the City of New York. She has over 30 years in tech and 20 as a CTO, and is focused on inspiring equity in tech. <a title=\"https://twitter.com/minervatweet\" href=\"https://twitter.com/minervatweet\" target=\"__blank\">https://twitter.com/minervatweet</a></p>\n<p>Julie Iskow, EVP/CTO at Medidata Solutions<br />\nPrior to her current role as CTO of Medidata, Julie was the CIO at WageWorks, after having held engineering and technology leadership positions in high-tech manufacturing. Julie&#8217;s focus is leveraging tech and data to revolutionize businesses/communities and transform lives; she has a BS from UC Berkeley and an MS from UC Davis. <a title=\"https://twitter.com/JulieIskow\" href=\"https://twitter.com/JulieIskow\" target=\"__blank\">https://twitter.com/JulieIskow</a></p>\n","date":"April 17, 2018","categories":[{"name":"nyc","slug":"nyc"},{"name":"write/speak/code","slug":"writespeakcode"}],"tags":null,"author":{"name":"jessica","slug":"jessica"}}},"pageContext":{"id":"5c72fc2c-83cc-51d1-a626-cc21a51e8409"}}